In [ ]:
from sql_helper import run_sql, get_config

config = get_config()
print("SQL helper module loaded successfully!")
print(f"Using Docker network: {config['docker_network']}")
print(f"Using Docker image: {config['docker_image']}")

## Exercise 3.01a
ID numbers, last names, and first names of students who enrolled in the Mathematics course but did not enroll in the Statistics course.
Write the query using the subquery syntax according to the following algorithm:
* in the innermost query, select the IDs of students who have enrolled in the statistics (you need to use join here),
* in the next query, select the IDs of students who enrolled in the mathematics (you also need to use join) and did not enroll in the statistics (their IDs are not in the set returned by the previous query),
* external query selects data about students whose IDs belong to the set returned by the middle query.

**Expected result:** 5 records, students with ids: 3, 6, 16, 20, 33

In [ ]:
query = """

"""
run_sql(query, "3.01a")

## Exercise 3.01b
Note that in the above query, part of the code had to be repeated:
```sql
SELECT student_id
FROM students_modules sm INNER JOIN modules m 
ON sm.module_id=m.module_id
WHERE module_name='Mathematics'/'Statistics'
```
Create a function whose parameter will be the name of the module, and which will return the IDs of students enrolled in that module, and use this function (twice) in the query from the above task to shorten the code.

In [ ]:
query = """

"""
run_sql(query, "3.01b")

## Exercise 3.02
Create a function called `studmod_f` that returns the last names and first names of students enrolled in the module whose name is passed to the function as a parameter. Run the function, specifying the name of the selected module as a parameter.

**Expected result:**
* `SELECT * FROM studmod_f('Mathematics')` returns 6 records
* `SELECT * FROM studmod_f('Statistics')` returns 4 records
* `SELECT * FROM studmod_f('Databases')` returns 2 records

In [ ]:
query = """

"""
run_sql(query, "3.02")

## Exercise 3.03a
**ROW_NUMBER() function**

All data from the `student_grades` table, within each `module_id` (partition by), sorted by exam date and then student ID, and numbered consecutively (use `ROW_NUMBER` function). The field containing the consecutive grade number within each `module_id` should be named `sequence_num`.

**Expected result:** 58 records,
* the first three refer to the module with id=1 (the sequence_num column contains numbers 1, 2, 3)
* the next five concern the module with id=2 (the sequence_num column contains numbers 1-5)

In [ ]:
query = """

"""
run_sql(query, "3.03a")

## Exercise 3.03b
**ROW_NUMBER() function**

Create view named `earlies_exams_v` for above query. Use the view to select the three earliest exams for every module.

**Expected result:** 43 rows
* For modules number 5, 8, 11, and 22 there are only two records.
* For modules number 10, 13, 14, 16 20 there is only one exam.

In [ ]:
query = """

"""
run_sql(query, "3.03b")

## Exercise 3.04
**ROW_NUMBER() function**

Student IDs and surnames, as well as exam dates, sorted by exam date, partitioned by `student_id` and numbered consecutively for each `student_id`. The query should return only data on failing grades (equal to 2). The field containing the consecutive grade number for each `student_id` should be named `sequence_num`.

**Expected result:** 13 records
* students with IDs 2, 3, 12 have two grades 2,0 each
* students with IDs 1, 6, 7, 8, 10, 20, 33 have one 2,0 grade each

In [ ]:
query = """

"""
run_sql(query, "3.04")

## Exercise 3.05
**ROW_NUMBER() function**

All data from the `students` table partitioned by `group_no`. Within each `group_no`, data sorted by student's date of birth. Within each group, records are to be numbered.

**Expected result:** 35 records.
* Note that in the first 7 records, `group_no` is NULL and these records are treated as a single partition.
* There are 6 students in the DMIe1011 group (the date of birth of the first student is NULL).
* There is one student in the DMIE1014 group.
* The date of birth of the first student in the ZMIe2011 group is 1990-01-30 (Melissa Hunt).
* In the last two records, the field containing the sequential number in a given group contains the value 5 (in the penultimate record) and 1 (in the last record).

In [ ]:
query = """

"""
run_sql(query, "3.05")

## Exercise 3.06a
The ID, surname, and date of the last exam for each student. The query should only return data about students who have taken at least one exam.
Write the query in two versions: once using derived tables syntax, and once using CTE.

**Expected result:** 21 records
* Third: 3, Hunt, 2018-09-20
* The last: 33, Bowen, 2018-09-23

In [ ]:
query = """

"""
run_sql(query, "3.06a")

## Exercise 3.06b
Using the previous query, create a function called `last_exams` that returns the ID, surname, and date of the last exams taken by each student, where the number of exams is equal to the value of the function parameter (e.g., if the number 4 is specified as the function parameter, the function should return the dates of the last 4 exams taken by each student).
Run the function and check that it works correctly.

**Expected result:**
* `SELECT * FROM last_exams(1)` returns 21 records
* `SELECT * FROM last_exams(2)` returns 37 records
* `SELECT * FROM last_exams(4)` returns 52 records

In [ ]:
query = """

"""
run_sql(query, "3.06b")

## Exercise 3.07a
All data about the two youngest students in each group. In the query, omit data about students who are not assigned to any group and those who do not have a date of birth assigned.
Write the query in two versions: once using derived tables syntax, once using CTE.

**Expected result:** 17 records
* In groups DMIe1014, DMZa3013, DZZa3001, ZMIe2014, and ZZIe2003, only one student has their date of birth entered.
* 6th record: Rebecca Mason, DMZa3012, born 1988-12-10
* 15th record: Katie Powell, ZZIe2012, born 2001-01-20

In [ ]:
query = """

"""
run_sql(query, "3.07a")

## Exercise 3.07b
Using the previous query, write a function called `youngest_students` that returns data about the number of the youngest students specified by the first parameter of the function, from the group whose name is specified as the second parameter.
Run the function (using the SELECT statement) and check that it works correctly.

**Expected result:**
* `SELECT * FROM youngest_students(4, 'DMIe1011')` returns 4 records, students with IDs: 1, 29, 30, 6
* `SELECT * FROM youngest_students(3, 'ZMIe2012')` Returns empty table
* `SELECT * FROM youngest_students(5, 'DZZa3001')` Returns one record, student with id=19

In [ ]:
query = """

"""
run_sql(query, "3.07b")

## Exercise 3.08a
**Recursive CTE**

`module_id`, `module_name`, and `no_of_hours` for module with ID 9, along with the chain of preceding modules. Name the column containing the next level “distance.”

**Expected result:** 4 records:
* 9 Econometrics 45 (distance 0)
* 8 Advanced Statistics 9 (1)
* 5 Statistics 30 (2)
* 4 Mathematics 15 (3)

In [ ]:
query = """

"""
run_sql(query, "3.08a")

## Exercise 3.08b
Based on the above query, create a function called `preceding_modules` that returns the `module_id`, `module_name`, and `no_of_hours` of the module with the ID specified as a function parameter, along with preceding modules.

**Expected result:**
* For parameter 9, the function returns 4 records (the same as the query above).
* For parameter 5, the function returns 2 records (modules with IDs 5 and 4).
* For parameter 8, the function returns 3 records (modules with IDs 8, 5, and 4).

In [ ]:
query = """

"""
run_sql(query, "3.08b")